{
  "uuid": "225130e7-f721-4f85-90ba-714baa50fd3b",
  "version": "0.1",
  "sources": [
    {
      "id": "CupQDkGZ4lw",
      "url": "https://www.youtube.com/watch?v=CupQDkGZ4lw",
      "site": "youtube"
    },
    {
      "id": "news_canada_british-columbia_bc-wildfire-july-18-1.6909596",
      "url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfire-july-18-1.6909596",
      "site": "scrape"
    }
  ],
  "components": [
    {
      "source_url": "https://www.youtube.com/watch?v=CupQDkGZ4lw",
      "type": "transcript",
      "content": [
        {
          "text": "Well, this morning, New Yorkers are once again being urged to prepare for smoke from the wildfires burning in western Canada. Air quality health advisories are being issued",
          "start": 0.9,
          "duration": 8.109
        },
        {
          "text": "for the entire state as winds are expected to carry a smoky haze to the northeast yet again this week. Now comes as Canada is experiencing its worst fire season on record.",
          "start": 9.009,
          "duration": 9.742
        },
        {
          "text": "About 25 million acres have burned so far this year. They've come all the way from America's southwest Well, welcome to Quebec now here in northern Quebec's scorched land.",
          "start": 19.085,
          "duration": 13.248
        },
        {
          "text": "Joining hundreds of other American and international firefighters doing what they can to slow wildfires that just won't quit. At this point, we're just trying to secure the edge and make sure",
          "start": 35.769,
          "duration": 13.112
        },
        {
          "text": "that the communities are safe. The Silver State Hotshot crew is looking for hotspots. They are firefighting crews, specially trained and skilled, now taking on Canada's record breaking wildfires.",
          "start": 49.082,
          "duration": 13.713
        },
        {
          "text": "I know here from Montana, Big Sky Country, but this is a big fire, big territory. And the scope for us in the states, this would be one of the largest fires ever to occur and in the United States. So, yeah, it's a gig of fire.",
          "start": 63.363,
          "duration": 13.513
        },
        {
          "text": "The total area burned in Canada already has shattered records now. 10 million hectares. That's almost 25 million acres, an area nearly as large as the state of Ohio. And still burning. And when they burn like this,",
          "start": 77.644,
          "duration": 14.547
        },
        {
          "text": "there's no way to even put people in front of it to even stop the fire. There's no amount of resources on the ground or from the sky. That's going to be able to stop one of these fires when they",
          "start": 92.792,
          "duration": 8.942
        },
        {
          "text": "when they get the momentum. As shocking and frankly, unsettling as it is, this fire is just far too large to extinguish. In fact, the area already burned",
          "start": 101.734,
          "duration": 10.044
        },
        {
          "text": "is larger than most countries on the planet. It means that not only does the fire burn, but there is going to be a lot of smoke. And that means many American cities could be shrouded in",
          "start": 112.412,
          "duration": 11.078
        },
        {
          "text": "smoke on any given day for weeks or months to come. Don't be surprised if if it continues. And secondly, this is this is a problem that is going to go on into the future",
          "start": 124.724,
          "duration": 11.411
        },
        {
          "text": "when it's the year to burn. And the conditions are right. It's just going to continue to burn. Here in Quebec, many were evacuated within minutes as the flames threaten towns and fires burned with raging speed.",
          "start": 136.402,
          "duration": 13.047
        },
        {
          "text": "American Jimmy Seaborn is grateful to see American help. He says he had minutes to leave in June and was upset to leave behind the family pets. They were fine when he returned six days later,",
          "start": 149.983,
          "duration": 11.478
        },
        {
          "text": "but he fears his home will be threatened again to inquire about normal weights. Incredible. But it's not normal. Not once. No, no, no, no. He says it's not normal, but cautions",
          "start": 161.728,
          "duration": 12.112
        },
        {
          "text": "we should all learn to expect the worst from the weather now. The rain helps. It has finally arrived in some places. But in the words of one Canadian official, it's like a drop in an otherwise",
          "start": 174.24,
          "duration": 10.979
        },
        {
          "text": "empty bucket. The mayor of this town, Sugar Mill, says the rain is an answered prayer. She may not have to evacuate her town again, but they have to adapt.",
          "start": 185.552,
          "duration": 9.442
        },
        {
          "text": "She says no one imagined so much would burn so quickly. Were you scared? I strangely, I wasn't scared. I was mad. And then I have to come down and say, I know you have a job to do.",
          "start": 194.994,
          "duration": 12.38
        },
        {
          "text": "And that's why, you know, I say stay calm. And I said to my people, let's be patient. Let's do it and keep it Zen. It may be difficult to stay calm as Mother Nature rages.",
          "start": 208.575,
          "duration": 12.245
        },
        {
          "text": "The cliche applies here in every way possible. Canada is burning and it's not out of the woods yet. You know what's so incredible to think of? There are fires burning right",
          "start": 222.088,
          "duration": 12.279
        },
        {
          "text": "through this country from one end to the other. And to that end, the Canadian government called in the Canadian military, this time in Canada's West, to help deal with those wildfires.",
          "start": 235.501,
          "duration": 10.678
        },
        {
          "text": "You cannot put too fine a point on it, Abbie and Phil, we are little more than halfway through the fire season. So have a look at those air quality indexes. We will be watching them for",
          "start": 246.179,
          "duration": 9.843
        },
        {
          "text": "weeks, maybe months to come. No end in sight. Paula Newton reporting thank you.",
          "start": 256.022,
          "duration": 3.837
        }
      ]
    },
    {
      "source_url": "https://www.youtube.com/watch?v=CupQDkGZ4lw",
      "type": "generated",
      "content": "New Yorkers Urged to Prepare for Smoke from Canadian Wildfires\n\nNew York City residents are once again being advised to prepare for smoke from the wildfires that continue to burn in western Canada. Air quality health advisories have been issued for the entire state as winds are expected to carry a smoky haze to the northeast this week. Canada is currently experiencing its worst fire season on record, with about 25 million acres already burned this year.\n\nFirefighters from around the world, including the Silver State Hotshot crew from Montana, have joined hundreds of American and international firefighters in northern Quebec to combat the relentless wildfires. These specially trained and skilled crews are doing their best to secure the edge of the fires and ensure the safety of nearby communities.\n\nThe scale of the wildfires in Canada is staggering, with a total area burned of 10 million hectares, equivalent to almost 25 million acres. This area is nearly as large as the state of Ohio and larger than most countries on the planet. The fires have become too large to extinguish, and the only result is an abundance of smoke. This means that many American cities could be shrouded in smoke for weeks or even months to come.\n\nWhile some areas have received much-needed rain, it is described as a mere drop in an otherwise empty bucket. The mayor of Sugar Mill, a town threatened by the fires, expresses gratitude for the rain but emphasizes the need to adapt to these new weather patterns. The Canadian government has even called in the military to assist in dealing with the wildfires.\n\nAs the fire season continues, there is no end in sight for the smoke and destruction caused by the Canadian wildfires. Residents are urged to stay informed about air quality indexes and be prepared for the worst. The resilience and determination of firefighters and affected communities are evident as they face this ongoing challenge.\n\nSources:\n- Video: https://www.youtube.com/watch?v=CupQDkGZ4lw\n- Transcript: Paula Newton reporting."
    },
    {
      "source_url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfire-july-18-1.6909596",
      "type": "scrape",
      "content": "       Content Skip to Main Content Accessibility Help Menu When search suggestions are available use up and down arrows to review and enter to select. Search Search Sign In Quick Links News Sports Radio Music Listen Live TV Watch news Top Stories Local Climate World Canada Politics Indigenous Opinion The National Business Health Entertainment Science CBC News Investigates Go Public About CBC News Being Black in Canada More  The 2023 wildfire season is now B.C.'s most destructive on record — and it's only mid-July | CBC News Loaded British Columbia The 2023 wildfire season is now B.C.'s most destructive on record — and it's only mid-July The 2023 wildfire season in British Columbia has officially surpassed the 2018 season as the most destructive ever recorded according to area burned. Over 13,900 sq. km of land has now burned, amid recent surge in fire activity CBC News  · Posted: Jul 18, 2023 9:49 AM EDT | Last Updated: July 19 See smoke from a wildfire near Cranbrook, B.C. 1 day ago Duration 0:34 The St. Mary's River wildfire burning near Cranbrook has grown to around 300 hectares, British Columbia's wildfire service says. The 2023 wildfire season in British Columbia has officially surpassed the 2018 season as the most destructive ever recorded according to area burned. Statistics from the B.C. Wildfire Service (BCWS) show wildfires have burned more than 14,100 square kilometres of land this year, breaking the record of just over 13,500 square kilometres set in 2018. The record fell after a weekend that showed a large uptick in fire activity, with the Canadian Armed Forces now assisting the BCWS with hundreds of fires across the province. More than 390 fires were burning in B.C. as of 10 p.m. PT Monday, most of them in central and northeastern parts of the province. Just over 20 of those are considered \"wildfires of note,\" which means they are particularly visible or pose a threat to public safety. They include the \"aggressive\" Young Creek fire that exploded in size over the weekend and cut off highway access for the Central Coast community of Bella Coola. Highway 20 remains closed due to the wildfire, according to DriveBC at 10 p.m. PT Monday. 'Like a nuclear bomb went off': B.C. musician raced to beat Hwy 20 closure as wildfire closed in Military begins deployment, highway to Bella Coola closed as hundreds of wildfires burn across B.C. More than 70 emergency alerts and orders were in place across the province on Monday. An evacuation alert means residents should prepare to evacuate their homes, possibly with little to no notice. An evacuation order means a resident should leave immediately. The southeast has also seen an uptick in fire activity. The Canadian Rockies International Airport north of Cranbrook cancelled flights on Monday due to the St. Mary's River wildfire, which led to the tactical evacuation of residents in a nearby First Nation. On Monday, the B.C. Wildfire Service said a blaze 15 kilometres north of West Kelowna, B.C. was highly visible to residents in the area, and it also resulted in an evacuation alert for 18 properties later that night. On Monday, the B.C. Coroners Service issued a public safety bulletin after a nine-year-old boy died after an asthma attack that his parents say was made worse by wildfire smoke. Special weather statements warning of smoke continue to cover most of eastern B.C. Cranbrook, B.C., airport reopens after cancelling flights due to nearby wildfire Boy, 9, died of asthma attack made worse by wildfire smoke, parents say B.C.'s drought bulletin also continues to show widespread drought conditions, with the fire danger rating ranked at high to extreme across much of the province. Four of the 34 basins the province monitors are ranked at the most severe level of drought. That includes all of Vancouver Island, the Bulkley-Lakes basin and the Fort Nelson basin. With files from The Canadian Press CBC's Journalistic Standards and Practices | About CBC News Corrections and clarifications | Submit a news tip | Report error Related Stories  Top stories from British Columbia  B.C. residents 'hack' unaffordable housing by partnering up to buy homes Analysis  Why Ottawa's decisions over the future of the RCMP could impact B.C.'s own decision in Surrey  End to Fraser Valley bus strike may be in sight as union recommends accepting mediator's proposal Footer Links My Account Profile CBC Gem Newsletters About CBC Accounts Connect with CBC Facebook Twitter YouTube Instagram Mobile RSS Podcasts Contact CBC Submit Feedback Help Centre Audience Relations, CBC P.O. Box 500 Station A Toronto, ON Canada, M5W 1E6  Toll-free (Canada only): 1-866-306-4636 About CBC Corporate Info Sitemap Reuse & Permission Terms of Use Privacy Jobs Our Unions Independent Producers Political Ads Registry AdChoices Services Ombudsman Corrections and Clarifications Public Appearances Commercial Services CBC Shop Doing Business with Us Renting Facilities Radio Canada International CBC Lite Accessibility It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on  CBC Gem . About CBC Accessibility Accessibility Feedback © 2023 CBC/Radio-Canada. All rights reserved.  Visitez Radio-Canada.ca now    "
    },
    {
      "source_url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfire-july-18-1.6909596",
      "type": "generated",
      "content": "The 2023 wildfire season in British Columbia has become the most destructive on record, surpassing the 2018 season, according to the CBC News. Over 13,900 square kilometers of land have already been burned, with recent fire activity contributing to the record-breaking numbers. The B.C. Wildfire Service (BCWS) has reported that wildfires have burned more than 14,100 square kilometers of land this year, breaking the previous record of just over 13,500 square kilometers set in 2018.\n\nThe surge in fire activity has led to the Canadian Armed Forces assisting the BCWS with hundreds of fires across the province. As of Monday evening, more than 390 fires were burning in B.C., with over 20 of them considered \"wildfires of note\" due to their visibility or threat to public safety. One such fire, the Young Creek fire, has grown significantly and cut off highway access for the Central Coast community of Bella Coola. Highway 20 remains closed due to the wildfire.\n\nThe province has also seen an increase in fire activity in the southeast. The St. Mary's River wildfire near Cranbrook led to the cancellation of flights at the Canadian Rockies International Airport and the tactical evacuation of nearby First Nation residents. Another fire near West Kelowna resulted in an evacuation alert for 18 properties.\n\nIn addition to the wildfires, the province is facing widespread drought conditions, with the fire danger rating ranked as high to extreme across much of the province. Four of the 34 basins monitored by the province are experiencing the most severe level of drought, including Vancouver Island, the Bulkley-Lakes basin, and the Fort Nelson basin.\n\nThe impact of the wildfires extends beyond property damage and evacuation orders. A nine-year-old boy tragically died after an asthma attack that his parents believe was exacerbated by wildfire smoke. Special weather statements warning of smoke continue to cover most of eastern B.C.\n\nThe CBC News also provides resources for readers, such as information on evacuation alerts and orders, as well as ways to submit news tips or report errors. The article concludes with related stories and footer links to CBC's various services and platforms.\n\nOverall, the CBC News article highlights the severity of the 2023 wildfire season in British Columbia, providing information on the extent of the damage, the response efforts, and the ongoing challenges faced by residents in affected areas."
    },
    {
      "source_url": "",
      "type": "generated",
      "content": "New Yorkers Urged to Prepare for Smoke from Canadian Wildfires\n\nNew York City residents are once again being advised to prepare for smoke from the wildfires that continue to burn in western Canada. Air quality health advisories have been issued for the entire state as winds are expected to carry a smoky haze to the northeast this week. Canada is currently experiencing its worst fire season on record, with about 25 million acres already burned this year.\n\nFirefighters from around the world, including the Silver State Hotshot crew from Montana, have joined hundreds of American and international firefighters in northern Quebec to combat the relentless wildfires. These specially trained and skilled crews are doing their best to secure the edge of the fires and ensure the safety of nearby communities.\n\nThe scale of the wildfires in Canada is staggering, with a total area burned of 10 million hectares, equivalent to almost 25 million acres. This area is nearly as large as the state of Ohio and larger than most countries on the planet. The fires have become too large to extinguish, and the only result is an abundance of smoke. This means that many American cities could be shrouded in smoke for weeks or even months to come.\n\nWhile some areas have received much-needed rain, it is described as a mere drop in an otherwise empty bucket. The mayor of Sugar Mill, a town threatened by the fires, expresses gratitude for the rain but emphasizes the need to adapt to these new weather patterns. The Canadian government has even called in the military to assist in dealing with the wildfires.\n\nAs the fire season continues, there is no end in sight for the smoke and destruction caused by the Canadian wildfires. Residents are urged to stay informed about air quality indexes and be prepared for the worst. The resilience and determination of firefighters and affected communities are evident as they face this ongoing challenge.\n\nThe 2023 wildfire season in British Columbia has become the most destructive on record, surpassing the 2018 season, according to the CBC News. Over 13,900 square kilometers of land have already been burned, with recent fire activity contributing to the record-breaking numbers. The B.C. Wildfire Service (BCWS) has reported that wildfires have burned more than 14,100 square kilometers of land this year, breaking the previous record of just over 13,500 square kilometers set in 2018.\n\nThe surge in fire activity has led to the Canadian Armed Forces assisting the BCWS with hundreds of fires across the province. As of Monday evening, more than 390 fires were burning in B.C., with over 20 of them considered \"wildfires of note\" due to their visibility or threat to public safety. One such fire, the Young Creek fire, has grown significantly and cut off highway access for the Central Coast community of Bella Coola. Highway 20 remains closed due to the wildfire.\n\nThe province has also seen an increase in fire activity in the southeast. The St. Mary's River wildfire near Cranbrook led to the cancellation of flights at the Canadian Rockies International Airport and the tactical evacuation of nearby First Nation residents. Another fire near West Kelowna resulted in an evacuation alert for 18 properties.\n\nIn addition to the wildfires, the province is facing widespread drought conditions, with the fire danger rating ranked as high to extreme across much of the province. Four of the 34 basins monitored by the province are experiencing the most severe level of drought, including Vancouver Island, the Bulkley-Lakes basin, and the Fort Nelson basin.\n\nThe impact of the wildfires extends beyond property damage and evacuation orders. A nine-year-old boy tragically died after an asthma attack that his parents believe was exacerbated by wildfire smoke. Special weather statements warning of smoke continue to cover most of eastern B.C.\n\nThe CBC News also provides resources for readers, such as information on evacuation alerts and orders, as well as ways to submit news tips or report errors. The article concludes with related stories and footer links to CBC's various services and platforms.\n\nOverall, the CBC News article highlights the severity of the 2023 wildfire season in British Columbia, providing information on the extent of the damage, the response efforts, and the ongoing challenges faced by residents in affected areas."
    }
  ],
  "filename": "1689794173-youtube-scrape"
}